In [1]:
import pandas as pd
import numpy as np

In [7]:
s1 = {'Name':['Anju','Suman'],'Class':[7,11]}

In [8]:
d1 = pd.DataFrame(s1)

In [9]:
d1

    Name  Class
0   Anju      7
1  Suman     11

In [23]:
s2 = pd.Series(['Anju','Suman'],index =['First','Last'])
s3 = pd.Series([7,11],index=['First','Last'])
dict1 = {'Name':s2, 'Class':s3}
d2 = pd.DataFrame(dict1)

In [24]:
d2

        Name  Class
First   Anju      7
Last   Suman     11

In [12]:
d2['RollNo']=[21,22]

In [13]:
d2

    Name  Class  RollNo
0   Anju      7      21
1  Suman     11      22

In [14]:
d2['RollNo']=[23,27]

In [15]:
d2

    Name  Class  RollNo
0   Anju      7      23
1  Suman     11      27

In [16]:
d2['Class']=[12,12]

In [17]:
d2

    Name  Class  RollNo
0   Anju     12      23
1  Suman     12      27

**

In [18]:
d2.index=['First','Second']

In [19]:
d2

         Name  Class  RollNo
First    Anju     12      23
Second  Suman     12      27

In [136]:
d2.at[2,:]=['Suthan',12,23]

In [137]:
d2

     Name  Class  RollNo
0    Anju   12.0    23.0
1   Suman   12.0    27.0
2  Suthan   12.0    23.0

# 2

In [31]:
s1 = {'Arnab':{'Maths': 90,'Science':91,'English':85,'Hindi':87},
      'Ramit':{'Maths': 92,'Science':81,'English':86,'Hindi':96},
      'Samridhi':{'Maths': 89,'Science':91,'English':83,'Hindi':88},
      'Riya':{'Maths': 81,'Science':71,'English':80,'Hindi':67},
      'Mallika':{'Maths': 94,'Science':95,'English':90,'Hindi':99}}

In [32]:
d1 = pd.DataFrame(s1)

In [33]:
d1

         Arnab  Ramit  Samridhi  Riya  Mallika
Maths       90     92        89    81       94
Science     91     81        91    71       95
English     85     86        83    80       90
Hindi       87     96        88    67       99

In [34]:
d1['Amit']=[90,92,95,89]

In [35]:
d1

         Arnab  Ramit  Samridhi  Riya  Mallika  Amit
Maths       90     92        89    81       94    90
Science     91     81        91    71       95    92
English     85     86        83    80       90    95
Hindi       87     96        88    67       99    89

In [37]:
d1.insert(2,'Amit1',[90,92,95,89])
d1

         Arnab  Ramit  Amit1  Samridhi  Riya  Mallika  Amit
Maths       90     92     90        89    81       94    90
Science     91     81     92        91    71       95    92
English     85     86     95        83    80       90    95
Hindi       87     96     89        88    67       99    89

In [38]:
del d1['Riya']

In [39]:
del d1['Ramit']
del d1['Samridhi']

In [40]:
d1

         Arnab  Amit1  Mallika  Amit
Maths       90     90       94    90
Science     91     92       95    92
English     85     95       90    95
Hindi       87     89       99    89

In [41]:
d1=d1.drop(["Amit"],axis=1)

In [42]:
d1

         Arnab  Amit1  Mallika
Maths       90     90       94
Science     91     92       95
English     85     95       90
Hindi       87     89       99

# 3

In [43]:
s1 = {'Wing':{'W1':'Pre-primary','W2':'Primary','W3':'Middle','W4':'Senior'},
     'Desktop':{'W1':15,'W2':22,'W3':18,'W4':30},
     'Laptops':{'W1':5,'W2':10,'W3':18,'W4':15}}

In [44]:
d1 = pd.DataFrame(s1)

In [45]:
d1

           Wing  Desktop  Laptops
W1  Pre-primary       15        5
W2      Primary       22       10
W3       Middle       18       18
W4       Senior       30       15

In [46]:
d1.at['W3','Desktop']

18

In [47]:
d1.at['W5',:]=['Secondary',20,15]

In [48]:
d1

           Wing  Desktop  Laptops
W1  Pre-primary     15.0      5.0
W2      Primary     22.0     10.0
W3       Middle     18.0     18.0
W4       Senior     30.0     15.0
W5    Secondary     20.0     15.0

In [49]:
d1=d1.drop(['W4'],axis=0)

In [50]:
d1

           Wing  Desktop  Laptops
W1  Pre-primary     15.0      5.0
W2      Primary     22.0     10.0
W3       Middle     18.0     18.0
W5    Secondary     20.0     15.0

# 4

In [51]:
s1 = {'Wing':{'W1':'Pre-primary','W2':'Primary','W3':'Middle','W4':'Senior'},
     'Desktop':{'W1':15,'W2':22,'W3':18,'W4':30},
     'Laptops':{'W1':5,'W2':10,'W3':18,'W4':15}}

In [52]:
d1 = pd.DataFrame(s1)

In [53]:
d1

           Wing  Desktop  Laptops
W1  Pre-primary       15        5
W2      Primary       22       10
W3       Middle       18       18
W4       Senior       30       15

In [55]:
print(d1['Wing'][d1['Desktop']>20])

W2    Primary
W4     Senior
Name: Wing, dtype: object

In [57]:
print(d1[['Wing','Laptops']][d1['Desktop']>20])

       Wing  Laptops
W2  Primary       10
W4   Senior       15

# 5

In [58]:
s1 = {'Name':{'P1':'Pen', 'P2':'Pencil','P3':'Sharpner'},'Price':{'P1':10, 'P2':5,'P3':3}}
d1 = pd.DataFrame(s1)
d1

        Name  Price
P1       Pen     10
P2    Pencil      5
P3  Sharpner      3

In [59]:
d1.at['P4',:]=['Rubber',2]

In [60]:
d1

        Name  Price
P1       Pen   10.0
P2    Pencil    5.0
P3  Sharpner    3.0
P4    Rubber    2.0

In [61]:
d1['Quantity']=[5,9,4,6]
d1

        Name  Price  Quantity
P1       Pen   10.0         5
P2    Pencil    5.0         9
P3  Sharpner    3.0         4
P4    Rubber    2.0         6

In [63]:
d1['Total Price']=d1['Price']*d1['Quantity']
d1

        Name  Price  Quantity  Total Price
P1       Pen   10.0         5         50.0
P2    Pencil    5.0         9         45.0
P3  Sharpner    3.0         4         12.0
P4    Rubber    2.0         6         12.0

In [66]:
d1.loc['P2',['Price','Quantity']]

Price       5.0
Quantity      9
Name: P2, dtype: object

In [67]:
d1.loc[['P1','P2']]

      Name  Price  Quantity  Total Price
P1     Pen   10.0         5         50.0
P2  Pencil    5.0         9         45.0

In [68]:
del d1['Quantity']

In [69]:
d1

        Name  Price  Total Price
P1       Pen   10.0         50.0
P2    Pencil    5.0         45.0
P3  Sharpner    3.0         12.0
P4    Rubber    2.0         12.0